# Хакер получил к классному журналу и хочет заменить все свои
# минимальные оценки на максимальные.
# Напишите программу, которая заменяет оценки Василия, но наоборот:
# все максимальные, на минимальные.
# Input: 5 -> 1 3 3 3 4
# Ouyput: 1 3 3 3 1
# import random

# list1 = [random.randint(1, 5) for i in range (int(input()))]
# print(list1)

# maxM = max(list1)
# minM = min(list1)

# for i in range(len(list1)):
#     if list1[i] == maxM:
#         list1[i] = minM
# print(list1)