# Напишите функцию, которая принимает одно число и проверяет,
# является ли оно простым.
# Напоминание: простое число - это число, 
# которое имеет два делителя: 1 и n(само число)
# Input: 5
# Output: yes

# def number(n):
#     flag = False
#     for i in range(2, n):
#         if n % 1 != 0:
#             continue
#         else:
#             flag = False
#             break
#     return flag
# print(number(вставить число)) 