# 1. Задайте список, состоящий из произвольных чисел, количество задаёт пользователь.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётных позициях(не индексах).
# in
# 5
# out
# [10, 2, 3, 8, 9]
# 22

# num = int(input('Введите количество чисел в списке: '))
# list = []
# sum = 0
# for i in range(num):
#    list_num = int(input(f'Введите число {i+1}: '))
#    list.append(list_num)
#    if i % 2 != 0:      # находим, четно или нечетно
#        sum += list[i]  # сумму этих элементов

# print(list, end=", а ещё в задаче требовалось узнать: ")
# print("cумму нечетных чисел = ", sum)
