# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# in                          in
# 4                           5
# out                         out 
# [2, 5, 8, 10]               [2, 2, 4, 8, 8] 
# [20, 40]                    [16, 16, 4]
# from random import  randint

# number = int(input('Введите размер списка '))
# list_1 = []
# list_2 = []

# for i in range (number):
#     list_1.append(randint(0, 9))

# for i in range(len(list_1)):
#     while number < len(list_1)/2 and number > len(list_1)/2:
#         number = number - 1
#         a = list_1[i] * list_1[number+1]
#         list_2.append()
#         i += 1

# print(list_1)
# print(list_2)



