# 3. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Без использования встроенной функции преобразования, без строк.
# in
# 88
# out
# 1011000

# num = int(input())
# num_list = []
# while num:
#     num_list.append(num % 2)
#     num //= 2
#     num_list.reverse ()
# print(num_list)