#Создать список, длин n, значения формируются по формуле 3к+1, 
# где к принимает значения от 1 до n включительно.
# in 3 
# out [4, 7, 10]
# num_list = []        #n = []- это уже список, просто list писать- это плохой тон
# n = int (input ('Введите длину списка '))
# for k in range (1, n+1):   # n+1 - т.е. n включительно
#     num_list.append (k*3+1)
# print (num_list)
