# Напишите прогу, в которой пользователь будет задавать две строки
# программа - определять кол-во вхождений одной строки в другой
# in gipopotampo
#     po
# out 3

a = input('Введите a: ')
b = input('Введите b: ')
print (a.count(b))